## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.tftest-mjw-mtasts.azurerm_storage_blob.error will be created
  + resource "azurerm_storage_blob" "error" {
      + access_tier            = (known after apply)
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "error.htm"
      + parallelism            = 8
      + size                   = 0
      + source_content         = "<html><head><title>Error Page</title></head><body><center><h1>Nothing to see</h1></center></body></html>"
      + storage_account_name   = "stmwtftestmtasts"
      + storage_container_name = "$web"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # module.tftest-mjw-mtasts.azurerm_storage_blob.index will be created
  + resource "azurerm_storage_blob" "index" {
      + access_tier            = (known after apply)
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "index.htm"
      + parallelism            = 8
      + size                   = 0
      + source_content         = "<html><head><title>Nothing to see</title></head><body><center><h1>Nothing to see</h1></center></body></html>"
      + storage_account_name   = "stmwtftestmtasts"
      + storage_container_name = "$web"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # module.tftest-mjw-mtasts.azurerm_storage_blob.mta-sts will be created
  + resource "azurerm_storage_blob" "mta-sts" {
      + access_tier            = (known after apply)
      + content_type           = "text/plain"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = ".well-known/mta-sts.txt"
      + parallelism            = 8
      + size                   = 0
      + source_content         = <<-EOT
            version: STSv1
            mode: testing
            mx: tftest-mjw.mail.protection.outlook.com
            max_age: 86400
        EOT
      + storage_account_name   = "stmwtftestmtasts"
      + storage_container_name = "$web"
      + type                   = "Block"
      + url                    = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>